[
  {
    "q": "Who won the 2010 FIFA World Cup?",
    "a": "Spain"
  },
  {
    "q": "Which player is known as 'The Divine Ponytail'?",
    "a": "Roberto Baggio"
  },
  {
    "q": "Who scored the 'Hand of God' goal?",
    "a": "Diego Maradona"
  },
  {
    "q": "Which club has won the most UEFA Champions League titles?",
    "a": "Real Madrid"
  },
  {
    "q": "Who is the all-time top scorer in the English Premier League?",
    "a": "Alan Shearer"
  },
  {
    "q": "Which stadium is nicknamed 'The Theatre of Dreams'?",
    "a": "Old Trafford"
  },
  {
    "q": "Who was the captain of France’s 1998 World Cup winning team?",
    "a": "Didier Deschamps"
  },
  {
    "q": "Who scored the fastest goal in World Cup history?",
    "a": "Hakan Şükür (11 seconds, 2002)"
  },
  {
    "q": "Which African country was the first to host the FIFA World Cup?",
    "a": "South Africa (2010)"
  },
  {
    "q": "Who has won the Ballon d'Or the most times?",
    "a": "Lionel Messi"
  },
  {
    "q": "Which team famously lost the Premier League in 2011-12 due to a last-minute Agüero goal?",
    "a": "Manchester United"
  },
  {
    "q": "Who is Brazil’s all-time top goal scorer?",
    "a": "Pele"
  },
  {
    "q": "Which country won the first ever FIFA World Cup (1930)?",
    "a": "Uruguay"
  },
  {
    "q": "Which England striker scored a hat-trick in the 1966 World Cup final?",
    "a": "Geoff Hurst"
  },
  {
    "q": "Which Italian club is known as 'The Old Lady'?",
    "a": "Juventus"
  },
  {
    "q": "Which player received the most red cards in his career?",
    "a": "Gerardo Bedoya"
  },
  {
    "q": "Who scored the only goal in the 2010 World Cup final?",
    "a": "Andrés Iniesta"
  },
  {
    "q": "Which club’s rivalry is known as 'El Clásico'?",
    "a": "Real Madrid vs. Barcelona"
  },
  {
    "q": "Who was Germany's winning World Cup captain in 2014?",
    "a": "Philipp Lahm"
  },
  {
    "q": "Which African country reached the World Cup quarterfinals for the first time in 1990?",
    "a": "Cameroon"
  },
  {
    "q": "Which Dutch club's academy produced Johan Cruyff?",
    "a": "Ajax"
  },
  {
    "q": "Which player is known for a ‘Panenka’ penalty?",
    "a": "Antonín Panenka"
  },
  {
    "q": "Which English manager won the Premier League with Leicester City?",
    "a": "Claudio Ranieri"
  },
  {
    "q": "Who is the only footballer to have played in a Super Bowl and a World Cup?",
    "a": "None – trick question"
  },
  {
    "q": "Who won the first ever Women's Ballon d'Or?",
    "a": "Ada Hegerberg"
  },
  {
    "q": "What is the maximum number of substitutions allowed per team in regular Premier League match (as of 2023)?",
    "a": "Five"
  },
  {
    "q": "Who won the Champions League three times as a manager with the same club?",
    "a": "Zinedine Zidane (Real Madrid)"
  },
  {
    "q": "Which country lost two World Cup finals in the 1970s?",
    "a": "Netherlands"
  },
  {
    "q": "Who is Africa’s top scorer at World Cup tournaments?",
    "a": "Asamoah Gyan"
  },
  {
    "q": "Which club plays its home games at San Siro?",
    "a": "AC Milan and Inter Milan"
  },
  {
    "q": "Who won the World Cup Golden Boot in 1998?",
    "a": "Davor Šuker"
  },
  {
    "q": "Which player is nicknamed 'The Pharaoh'?",
    "a": "Mohamed Salah"
  },
  {
    "q": "Who is the all-time leading scorer in the UEFA Champions League?",
    "a": "Cristiano Ronaldo"
  },
  {
    "q": "Which two countries have played the most World Cup matches against each other?",
    "a": "Brazil and Sweden"
  },
  {
    "q": "In what city would you find the stadium La Bombonera?",
    "a": "Buenos Aires"
  },
  {
    "q": "Which club was known as 'The Invincibles' in 2003-04?",
    "a": "Arsenal"
  },
  {
    "q": "Which country has reached three World Cup finals but never won?",
    "a": "Netherlands"
  },
  {
    "q": "Who managed Manchester United from 1986 to 2013?",
    "a": "Sir Alex Ferguson"
  },
  {
    "q": "Which club's fans are called The Kop?",
    "a": "Liverpool"
  },
  {
    "q": "Which player has the most appearances at FIFA World Cups?",
    "a": "Lothar Matthäus (25 appearances)"
  },
  {
    "q": "Which nation was the first to win the Euro and World Cup back-to-back?",
    "a": "Spain"
  },
  {
    "q": "Who scored the famous ‘ghost goal’ in the 1966 World Cup final?",
    "a": "Geoff Hurst"
  },
  {
    "q": "Who holds the record for most international hat-tricks?",
    "a": "Cristiano Ronaldo"
  },
  {
    "q": "Which African country knocked Spain out of the 2022 World Cup?",
    "a": "Morocco"
  },
  {
    "q": "Which footballer was once purchased for a world record transfer fee by Real Madrid in 2009?",
    "a": "Cristiano Ronaldo"
  },
  {
    "q": "Who has won the most FIFA Women’s World Cup titles?",
    "a": "USA"
  },
  {
    "q": "Which German striker is the all-time top scorer in World Cup tournaments?",
    "a": "Miroslav Klose"
  },
  {
    "q": "Who was Barcelona’s manager for most of the tiki-taka era?",
    "a": "Pep Guardiola"
  },
  {
    "q": "Which Asian nation reached the semi-finals of the 2002 World Cup?",
    "a": "South Korea"
  },
  {
    "q": "Which French club won the first ever European Cup (now Champions League) in 1956?",
    "a": "Trick question: it was Real Madrid (Spanish), not French!"
  }
]
